---
kind: property
id: P:Autodesk.Revit.DB.ElementRecord.WorksetId
source: html/94731dcf-8f9a-15ba-d956-074ab95ad942.htm
---
# Autodesk.Revit.DB.ElementRecord.WorksetId Property

Get Id of the workset which owns the element.

## Syntax (C#)
```csharp
public WorksetId WorksetId { get; }
```

## Remarks
Each element belongs to one and only one workset.